Tekla Open API Reference for Tekla Structures 2025
ViewBase Properties
The ViewBase type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
 (Inherited from DrawingObject.)
ExtremaCenter
 Gets the view extrema center.
FrameOrigin
 The vector from the view origin to the frame origin.
Height
 The height of the view frame in paper coordinates.
IsSheet
 Gets a value indicating whether the container view is the drawing's sheet.
Origin
 The view origin coordinates in the sheet.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Width
 The width of the view frame in paper coordinates.
Top
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace